package messages

import "fmt"

func Welcome(firstName string) string {
	return fmt.Sprintf(
		"سلام %s عزیز! 👋\nبرای شروع، یک فایل ارسال کن.\nبرای راهنمایی، دستور /help رو بزن یا از منوی زیر یکی از دکمه‌ها رو انتخاب کن.",
		firstName,
	)
}


// main menu buttons text
const (
	BtnBuySubscription = "🛍️ خرید اشتراک"
	BtnBuyExtraTraffic = "➕ خرید ترافیک اضاف"
	BtnMyProfile = "👤 حساب کاربری من"
	BtnSupport = "📞 پشتیبانی و راهنما"
)

const Help = `
📖 *راهنمای استفاده از ربات*

*1️⃣ ارسال فایل:*
فایل خود را برای ربات ارسال کنید. ربات اطلاعات فایل را بررسی و لینک دانلود تولید می‌کند.

*2️⃣ پروفایل:*
با دستور /profile می‌توانید:
- ترافیک باقی‌مانده خود را ببینید
- تاریخ انقضای پلن‌ها را چک کنید
- تاریخچه تراکنش‌ها را مشاهده کنید

*3️⃣ پلن‌ها:*
با دستور /plans می‌توانید:
- پلن‌های موجود را ببینید
- پلن مورد نظر را خریداری کنید

*4️⃣ ترافیک اضافی:*
با دستور /extra می‌توانید:
- بسته‌های ترافیک اضافی را ببینید
- ترافیک به پلن فعلی اضافه کنید

⚡️ *نکات مهم:*
- هر روز یک پلن رایگان ۲ گیگابایتی دریافت می‌کنید.
- خرید ترافیک اضافی تنها روی پلن‌های پولی امکان‌پذیر است.
- ترافیک اضافی خریداری‌شده فقط تا زمان پایان پلن فعال شما اعتبار دارد.
- در صورت خرید پلن جدید، پلن پولی قبلی شما (به همراه ترافیک اضافی خریداری شده) منقضی خواهد شد.
- حجم مصرفی اینترنت برای دانلود، به صورت نیم‌بها محاسبه می‌شود.
`